Revit 2027 API
ParameterTypeId.StructConnectionTypeName Property
 "Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructConnectionTypeName { get; }
Public Shared ReadOnly Property StructConnectionTypeName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructConnectionTypeName {
	ForgeTypeId^ get ();
}
static member StructConnectionTypeName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace